w7d1/skeleton1/app/controllers/toys_controller.rb

  def update
    @toy = Toy.find(params[:id])
    if @toy.update_attributes(toy_params)
---
SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT 1  [["id", 0]]
UPDATE "toys" SET "pokemon_id" = $1, "updated_at" = $2 WHERE "toys"."id" = $3  [["pokemon_id", 2], ["updated_at", "2015-08-04 00:35:59.298477"], ["id", 3]]