w7d4/skeleton/app/controllers/api/feeds_controller.rb

SELECT "feeds".* FROM "feeds" ORDER BY "feeds"."id" ASC
---
  def index
    render :json => Feed.order(:id)

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    # debugger
    render :json => Feed.find(params[:id]), include: :latest_entries